onec/config/Catalogs/ЛицевыеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЛицевыеСчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВнешнийID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

onec/config/Catalogs/Начисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Начисления</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВнешнийID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКопеек</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

onec/config/Catalogs/Платежи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Платежи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВнешнийID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКопеек</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

onec/config/HTTPServices/ReconAPI/Ext/Module.bsl
// HTTP-сервис ReconAPI: только чтение, формат CONTRACT.md v1.
// Ответ: {"value": [...]}, все строки одним ответом, без пагинации.
// Наружу отдаётся ВнешнийID (стабильный ID из fixtures/data.json), а не UUID 1С.
// Любая ошибка (нет прав, сбой БД) — исключение, платформа вернёт HTTP 500,
// а не пустой список.

Функция ПолучитьСчета(ВходящийЗапрос)

	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Т.ВнешнийID КАК ВнешнийID,
		|	Т.НомерСчета КАК НомерСчета
		|ИЗ
		|	Справочник.ЛицевыеСчета КАК Т
		|ГДЕ
		|	НЕ Т.ПометкаУдаления
		|УПОРЯДОЧИТЬ ПО
		|	ВнешнийID");
	Выборка = Запрос.Выполнить().Выбрать();

	Строки = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Строка = Новый Структура;
		Строка.Вставить("id", Выборка.ВнешнийID);
		Строка.Вставить("account_number", Выборка.НомерСчета);
		Строки.Добавить(Строка);
	КонецЦикла;

	Возврат ОтветJSON(Строки);

КонецФункции

Функция ПолучитьНачисления(ВходящийЗапрос)

	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Т.ВнешнийID КАК ВнешнийID,
		|	Т.ЛицевойСчет.ВнешнийID КАК СчетВнешнийID,
		|	Т.Период КАК Период,
		|	Т.СуммаКопеек КАК СуммаКопеек
		|ИЗ
		|	Справочник.Начисления КАК Т
		|ГДЕ
		|	НЕ Т.ПометкаУдаления
		|УПОРЯДОЧИТЬ ПО
		|	ВнешнийID");
	Выборка = Запрос.Выполнить().Выбрать();

	Строки = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Строка = Новый Структура;
		Строка.Вставить("id", Выборка.ВнешнийID);
		Строка.Вставить("account_id", СтрокаИлиNull(Выборка.СчетВнешнийID));
		Строка.Вставить("period", Формат(Выборка.Период, "ДФ=yyyy-MM"));
		Строка.Вставить("amount_kopecks", Выборка.СуммаКопеек);
		Строки.Добавить(Строка);
	КонецЦикла;

	Возврат ОтветJSON(Строки);

КонецФункции

Функция ПолучитьПлатежи(ВходящийЗапрос)

	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Т.ВнешнийID КАК ВнешнийID,
		|	Т.ЛицевойСчет.ВнешнийID КАК СчетВнешнийID,
		|	Т.ДатаПлатежа КАК ДатаПлатежа,
		|	Т.СуммаКопеек КАК СуммаКопеек
		|ИЗ
		|	Справочник.Платежи КАК Т
		|ГДЕ
		|	НЕ Т.ПометкаУдаления
		|УПОРЯДОЧИТЬ ПО
		|	ВнешнийID");
	Выборка = Запрос.Выполнить().Выбрать();

	Строки = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Строка = Новый Структура;
		Строка.Вставить("id", Выборка.ВнешнийID);
		Строка.Вставить("account_id", СтрокаИлиNull(Выборка.СчетВнешнийID));
		Строка.Вставить("date", Формат(Выборка.ДатаПлатежа, "ДФ=yyyy-MM-dd"));
		Строка.Вставить("amount_kopecks", Выборка.СуммаКопеек);
		Строки.Добавить(Строка);
	КонецЦикла;

	Возврат ОтветJSON(Строки);

КонецФункции

// Пустая ссылка на счёт отдаётся как null, а не как "": тогда приложение
// честно увидит запись без счёта (правило валидации), а не «счёт с ID ''».
Функция СтрокаИлиNull(Значение)

	Если Значение = NULL Или Не ЗначениеЗаполнено(Значение) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат Значение;

КонецФункции

Функция ОтветJSON(Строки)

	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет));
	ЗаписатьJSON(Запись, Новый Структура("value", Строки));

	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(Запись.Закрыть(), КодировкаТекста.UTF8,
		ИспользованиеByteOrderMark.НеИспользовать);
	Возврат Ответ;

КонецФункции
